snlkuharlocal/src/DataProcessors/ЗакрытиеБанковскогоДняАвансы/ЗакрытиеБанковскогоДняАвансы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗакрытиеБанковскогоДняАвансы</name>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыбДок</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>фВыполнятьВФоне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбДоговор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбУсловияОплаты</name>
    <type>
      <types>EnumRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокГП</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/ВзаиморасчетыПоДокументамРасчетов/ВзаиморасчетыПоДокументамРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоДокументамРасчетов</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРасчетов</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.КорректировкаЦенВНакладной</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ОтчетАгента</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.СписаниеТМЦСпути</types>
      <types>DocumentRef.ДвиженияДенежныхСредств</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Претензия</types>
      <types>DocumentRef.УслугиСтороннихОрганизаций</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.СписаниеКурсовыхРазниц</types>
      <types>DocumentRef.Машина</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/УсловияОплаты/УсловияОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияОплаты</name>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Отсрочка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидСчетаФактурыВыставленного/ВидСчетаФактурыВыставленного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчетаФактурыВыставленного</name>
  <enumValues>
    <name>НаАванс</name>
  </enumValues>
  <enumValues>
    <name>НаАвансКомитента</name>
  </enumValues>
  <enumValues>
    <name>НаАвансКомитентаНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйНаАванс</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>(Общ) Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ПоступлениеНаРасчетныйСчет/ПоступлениеНаРасчетныйСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаРасчетныйСчет</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Documents/Взаимозачет/Взаимозачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Взаимозачет</name>
  <comment>Взаимозачет</comment>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Претензия</basedOn>
  <basedOn>Document.ЗаявкаНаОплату</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент_Дебитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор_Дебитор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент_Кредитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор_Кредитор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Докоснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОплату</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.Претензия</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Взаимозачеты</name>
    <attributes>
      <name>Контрагент_Дебитор</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор_Дебитор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент_Кредитор</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор_Кредитор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ЗакрытиеБанковскогоДняАвансы/ObjectModule.bsl
Перем мВалютаУпр;
Перем ПустойУИД Экспорт;
Перем ЕстьОрганизацияВГП Экспорт;

#Область СозданиеПРС

Функция СформироватьППпоДДСзаПериод(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,Дата,Номер
	|ИЗ
	|	Документ.ДвиженияДенежныхСредств
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Проведен
	|	И БанковскийСчет ССЫЛКА Справочник.БанковскиеСчета	
	|";                             
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок  = Выборка.Количество();
	Сч = 0;
	
	Сообщить("К обработке: " + ВсегоСтрок + " выписок.");	
	
	мСсылок = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Сч = Сч + 1;                                                        
		
		Документы.ПоступлениеНаРасчетныйСчет.СоздатьППвходящие(Выборка.Ссылка);
						
		Если Сч % 10 = 0 ИЛИ Сч >= ВсегоСтрок Тогда			
			ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=0"), СтрШаблон("Обработано: %1 из %2", Сч, ВсегоСтрок));
		КонецЕсли;	
	КонецЦикла;	
	
	Результат.ОбработаноОбъектов = Сч;
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //СформироватьППпоДДСзаПериод

Функция ПроверитьНаличиеПРС(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Платежи.Ссылка 	КАК ДДС_Ссылка,    
	|	ПРС.Ссылка 		КАК ПРС_Ссылка,
	|	ПРС.Договор		КАК ДоговорПРС,
	|	Платежи.Договор	КАК ДоговорДДС,
	|	Платежи.КонтрагентПоБанку 	КАК Контрагент,
	|	Платежи.Приход  			КАК СуммаДДС,
	|	ПРС.СуммаДокумента 			КАК СуммаПРС,
	|	ВЫБОР
	|		КОГДА ПРС.Договор <> Платежи.Договор ТОГДА ""Не совпадает договор""
	|		КОГДА ПРС.Ссылка ЕСТЬ NULL ТОГДА ""Отсутствует ПРС""  
	|	ИНАЧЕ
	|		NULL
	|	КОНЕЦ КАК Ошибка,	
	|	Платежи.УИД_СтрокиПлатежа
	|ИЗ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПРС
	|ПО 
	|	Платежи.УИД_СтрокиПлатежа = ПРС.УИД_СтрокиПлатежа
	|ГДЕ
	|	Платежи.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Платежи.Ссылка.Проведен
	|	И Платежи.Приход > 0
	|	И (
	|		ПРС.Ссылка ЕСТЬ NULL ИЛИ ПРС.СуммаДокумента<>Платежи.Приход
	|		ИЛИ ПРС.Договор <> Платежи.Договор
	|	)	
	|УПОРЯДОЧИТЬ ПО
	|	Платежи.Ссылка.Дата,	
	|	Платежи.Ссылка.Номер
	|";
	
	мДата1 = НачалоМесяца(ТекущаяДата());
	мДата1 = НачалоМесяца(мДата1 - 1);
	
	Дата2 = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Дата2", ТекущаяДата());
	
	Запрос.УстановитьПараметр("Дата1", МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Дата1", мДата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	
	рЗапроса = Запрос.Выполнить();
	Выборка = рЗапроса.Выбрать();
	Если Выборка.Количество() > 0 Тогда
		ТекстОшибки = СтрШаблон("Найдено %1 строк ДДС без привязанных поступлений !", Выборка.Количество());
		Результат.Ошибки.Добавить(ТекстОшибки);
		Результат.Успешно = Ложь;
		
		ДопПараметры = Новый Структура("ВнешниеДанные", Новый Структура("рЗапроса", рЗапроса));		
		Результат.Данные = РаботаНадСКД_КС.ВывестиСхемуВТД(ПолучитьМакет("Проверка_ПРС"), , , ДопПараметры);		
	КонецЕсли;
	
	Результат.ОбработаноОбъектов = Выборка.Количество();
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции //ПроверитьНаличиеПРС(пОбработки, АдресВозврата = Неопределено) Экспорт


#КонецОбласти

Функция ВыполнитьПроверкиПакетом(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Результат.Вставить("ПакетныйРезультат", Истина);
	Результат.Данные = Новый Структура;
	
	Результат.Данные.Вставить("ПроверкаПРС", ПроверитьНаличиеПРС(пОбработки));
	
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ВыполнитьПроверкиПакетом(пОбработки, АдресВозврата = Неопределено) Экспорт

Функция Есть()

	

КонецФункции // ()

#Область ПроведениеПоВзаиморасчетыПоДокументамРасчетов

Функция УстановитьБлокировкуПоНаборуЗаписей(НаборЗаписей) Экспорт
	МетаРегистр = НаборЗаписей.Метаданные();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки 					= Блокировка.Добавить(НаборЗаписей.Метаданные().ПолноеИмя());
	ЭлементБлокировки.Режим 			= РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.ИсточникДанных 	= НаборЗаписей.Выгрузить();
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
	
	Блокировка.Заблокировать();	
КонецФункции //УстановитьБлокировкуПоНаборуЗаписей(НаборЗаписей) Экспорт

Процедура ДвиженияПоВзаимам(Период, Регистратор, УИД_СтрокиПлатежа, ТаблицаВзаиморасчетов)	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Договор.Владелец 				КАК Контрагент,
	|	Договор,
	|	Договор.ВалютаКредита			КАК ВалютаВзаиморасчетов,
	|	ДокументРасчетов,
	|	СуммаВалОстаток					КАК СуммаОстаток
	//,IsNull(ДокументРасчетов.ДатаОплаты, ДокументРасчетов.Дата) КАК ДатаОплаты
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов.Остатки(&МоментВремени, Договор В (&СписокДоговоров))	
	|УПОРЯДОЧИТЬ ПО 
	//|	ДатаОплаты, 
	|	ДокументРасчетов.Дата, 
	|	ДокументРасчетов
	|";
	
	Запрос.УстановитьПараметр("МоментВремени",		Новый МоментВремени(Период,Регистратор));
	Запрос.УстановитьПараметр("СписокДоговоров", 	ТаблицаВзаиморасчетов.ВыгрузитьКолонку("Договор"));	
	
	Движения = РегистрыНакопления.ВзаиморасчетыПоДокументамРасчетов.СоздатьНаборЗаписей();
	Движения.Отбор.Регистратор.Установить(Регистратор);
	
	рЗапроса = Запрос.Выполнить();
	
	ТО = рЗапроса.Выгрузить();
	ТО.Индексы.Добавить("Договор");
	
	Для Каждого СтрокаТВ Из ТаблицаВзаиморасчетов Цикл
		НадоСписать = СтрокаТВ.Сумма;
		
		СтрокиКУдалению = Новый Массив;
		
		СтрокиОстатков = ТО.НайтиСтроки(Новый Структура("Договор", СтрокаТВ.Договор));
		Для каждого СтрокаО Из СтрокиОстатков Цикл		
			#ЕСЛИ КЛИЕНТ ТОГДА
				ОбработкаПрерыванияПользователя();
			#КОНЕЦЕСЛИ
			
			Если НадоСписать < 0 Тогда
				ТекСумма = Мин(0, Макс(НадоСписать, -СтрокаО.СуммаОстаток));
			Иначе
				ТекСумма = Макс(0, Мин(НадоСписать, -СтрокаО.СуммаОстаток));
			КонецЕсли;
			Если ТекСумма <> 0 Тогда
				Движение = Движения.Добавить();
				
				Движение.Период				= Период;
				
				Движение.Контрагент			= СтрокаТВ.Контрагент; 
				Движение.Договор			= СтрокаТВ.Договор;					
				Движение.ДокументРасчетов	= СтрокаО.ДокументРасчетов;
				
				Движение.ВидДвижения		= ?(ТекСумма>0, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
				Движение.СуммаВал			= Модуль(ТекСумма);
				//Движение.СуммаУпр						=МодульВалютногоУчета.глПересчет(Движение.СуммаВзаиморасчетов,СтрокаТВ.ВалютаРасчетов,мВалютаУпр,Движение.Период,Движение.Период);
				
				НадоСписать = НадоСписать - ТекСумма;
				
				СтрокаО.СуммаОстаток = СтрокаО.СуммаОстаток + ТекСумма; 
				Если СтрокаО.СуммаОстаток = 0 Тогда
					СтрокиКУдалению.Добавить(СтрокаО);			
				КонецЕсли;
			КонецЕсли;					
		КонецЦикла;
		
		Для каждого СтрокаО Из СтрокиКУдалению Цикл
			ТО.Удалить(СтрокаО);		
		КонецЦикла;
		
		Если ""+СтрокаТВ.Договор = "Дог. № SSP-09167-04-15 от 13.04.2015" Тогда
			//Сообщить("Ура");		
		КонецЕсли;
		
		Сообщить(НадоСписать);
		Если НадоСписать <> 0 Тогда
			ТекСумма = НадоСписать;
			
			Движение = Движения.Добавить();
			
			Движение.Период				= Период;
			
			Движение.Контрагент			= СтрокаТВ.Контрагент;
			Движение.Договор			= СтрокаТВ.Договор;			
			Движение.ДокументРасчетов	= ПолучитьДокРасчетов(Регистратор, СтрокаТВ.УИД_СтрокиПлатежа);     
			
			Движение.ВидДвижения		= ?(ТекСумма>0, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
			Движение.СуммаВал			= Модуль(ТекСумма);
			//Движение.СуммаУпр			=МодульВалютногоУчета.глПересчет(Движение.СуммаВзаиморасчетов,СтрокаТВ.ВалютаРасчетов,мВалютаУпр,Движение.Период,Движение.Период);
			
			НадоСписать = НадоСписать - ТекСумма;			
		КонецЕсли;	
	КонецЦикла;	
	
	Попытка		
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);		
		
		Проведен = ПолучитьРеквизитШапки(Регистратор, "Проведен");
		
		Если НЕ Проведен = Истина И ТипЗнч(Регистратор) <> Тип("ДокументСсылка.КорректировкаЗаписейРегистров") Тогда
			Движения.Очистить();		
		КонецЕсли;
		
		УстановитьБлокировкуПоНаборуЗаписей(Движения);
		
		Движения.Записать();		
		
		ЗафиксироватьТранзакцию();
	Исключение		              
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();		
		КонецЕсли;
		ЗаписатьВЛог("ПроведениеПоВзаиморасчетам", "Ошибка записи: " + Регистратор + " " + ОписаниеОшибки(), "Ошибка");
	КонецПопытки;	

КонецПроцедуры

Функция ПолучитьДокРасчетов(Регистратор, УИД_СтрокиПлатежа)
	Результат = Регистратор;
	Если УИД_СтрокиПлатежа <> ПустойУИД Тогда
		Док = Документы.ПоступлениеНаРасчетныйСчет.НайтиПоРеквизиту("УИД_СтрокиПлатежа", УИД_СтрокиПлатежа);	
		Если Док.Пустая() Тогда
			Сообщить(УИД_СтрокиПлатежа);
		Иначе			
			Результат = Док;		
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьДокРасчетов(Регистратор, УИД_СтрокиПлатежа)

Функция ПровестиПоВзаиморасчетам(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Движения = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Движения");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	ВосстановлениеГП = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ВосстановлениеГП", Ложь);
	
	Запрос = Новый Запрос;
	
	Если Движения = Неопределено Тогда		
		Запрос.Текст = "	
		|ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|	Регистратор КАК Регистратор_
		|ПОМЕСТИТЬ ВТ_Регистраторы
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты
		|ГДЕ
		|	Период МЕЖДУ &Дата1 И &Дата2
		|	И Активность
		|	И НЕ Регистратор ССЫЛКА Документ.СписаниеКурсовыхРазниц		
		|	И Договор.Организация = &Организация
		|	" + ?(ЗначениеЗаполнено(ВыбДок),			" И Регистратор = &Регистратор", "") + "
		|	" + ?(ЗначениеЗаполнено(ВыбКонтрагент), 	" И Договор.Владелец = &Контрагент", "") + "
		|	" + ?(ЗначениеЗаполнено(ВыбДоговор),		" И Договор = &Договор", "") + "
		|	" + ?(ЗначениеЗаполнено(ВыбУсловияОплаты), 	" И Договор.УсловияОплаты = &УсловияОплаты", "") + "		
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|ВЫБРАТЬ
		|	Взаиморасчеты.Договор.Владелец 		КАК	Контрагент,
		|	Взаиморасчеты.Договор				КАК Договор,
		|	Взаиморасчеты.Договор.ВалютаКредита КАК ВалютаРасчетов,
		|	Взаиморасчеты.Регистратор			КАК Регистратор,
		|	Взаиморасчеты.Период				КАК Период,
		|	Взаиморасчеты.УИД_СтрокиПлатежа		КАК УИД_СтрокиПлатежа,
		|	МИНИМУМ(НомерСтроки)				КАК НомерСтроки,
		|	СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*СуммаВал) КАК СуммаВал
		|ИЗ
		|	ВТ_Регистраторы
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
		|ПО
		|	ВТ_Регистраторы.Регистратор_ = Взаиморасчеты.Регистратор		
		|";
	Иначе
		ТД = Движения.Выгрузить();
		ТД.Колонки.Удалить("МоментВремени");		
		
		Запрос.Текст = "	
		|ВЫБРАТЬ &Регистратор КАК Регистратор,ТД.* ПОМЕСТИТЬ ТД ИЗ &ТД КАК ТД
		|;
		|ВЫБРАТЬ
		|	Договор.Владелец 		КАК	Контрагент,
		|	Договор					КАК Договор,
		|	Договор.ВалютаКредита 	КАК ВалютаРасчетов,
		|	Регистратор,
		|	Период,
		|	УИД_СтрокиПлатежа,
		|	0	КАК НомерСтроки,
		|	СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*СуммаВал) КАК СуммаВал
		|ИЗ
		| ТД
		|";	
		
		Запрос.УстановитьПараметр("ТД", ТД);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО Период,Регистратор,Договор,УИД_СтрокиПлатежа
	|УПОРЯДОЧИТЬ ПО Период,Регистратор.Номер,НомерСтроки
	|ИТОГИ МИНИМУМ(Период),МИНИМУМ(Контрагент),СУММА(СуммаВал) ПО Регистратор,Договор,УИД_СтрокиПлатежа
	|";	
	
	Если ВосстановлениеГП Тогда                              
		ДатаГП = Последовательности.ВзаиморасчетыПоДокументам.ПолучитьГраницу().Дата;
		Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаГП));
	Иначе		
		Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));	
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Регистратор",	ВыбДок);
	Запрос.УстановитьПараметр("Контрагент",		ВыбКонтрагент);
	Запрос.УстановитьПараметр("Договор",		ВыбДоговор);
	Запрос.УстановитьПараметр("УсловияОплаты",	ВыбУсловияОплаты);
	
	УстановитьПривилегированныйРежим(Истина);
	рЗапроса = Запрос.Выполнить();
	
	ТО = Новый ТаблицаЗначений;
	ТО.Колонки.Добавить("Контрагент");
	ТО.Колонки.Добавить("Договор");
	ТО.Колонки.Добавить("ВалютаРасчетов");
	ТО.Колонки.Добавить("Сумма", ПолучитьОписаниеТиповЧисла(19,2));
	ТО.Колонки.Добавить("УИД_СтрокиПлатежа", Новый ОписаниеТипов("УникальныйИдентификатор")); 	
	
	ВыборкаПоДокументам = рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Регистратор");
	
	ВсегоСтрок 	= ВыборкаПоДокументам.Количество();
	Сч			= 0;	
	
	ТекстСообщения = СтрШаблон("К обработке: %1 док-ов.", ВсегоСтрок);
	ДлительныеОперации.СообщитьПрогресс(0, ТекстСообщения);		
	
	ОтборГП = ОтборГП();
	
	Пока ВыборкаПоДокументам.Следующий() Цикл		
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		Состояние("" + ВыборкаПоДокументам.Период + " " + ВыборкаПоДокументам.Регистратор);
		#КОНЕЦЕСЛИ
		ТО.Очистить();
		
		ВыборкаПоДоговорам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Договор");
		Пока ВыборкаПоДоговорам.Следующий() Цикл
			ВыборкаПоУИД = ВыборкаПоДоговорам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "УИД_СтрокиПлатежа");
			Пока ВыборкаПоУИД.Следующий() Цикл			
				Если ВыборкаПоУИД.СуммаВал = 0 Тогда Продолжить КонецЕсли; 
				
				СтрокаТО = ТО.Добавить();					
				
				СтрокаТО.Контрагент 		= ВыборкаПоДоговорам.Контрагент;
				СтрокаТО.Договор			= ВыборкаПоДоговорам.Договор;
				СтрокаТО.ВалютаРасчетов		= ВыборкаПоДоговорам.ВалютаРасчетов;
				СтрокаТО.Сумма				= ВыборкаПоУИД.СуммаВал;
				СтрокаТО.УИД_СтрокиПлатежа 	= ВыборкаПоУИД.УИД_СтрокиПлатежа;
			КонецЦикла;
		КонецЦикла;
					
		ДвиженияПоВзаимам(ВыборкаПоДокументам.Период, ВыборкаПоДокументам.Регистратор, ВыборкаПоДокументам.УИД_СтрокиПлатежа, ТО);
		
		ЗП	= Последовательности.ВзаиморасчетыПоДокументам.СоздатьНаборЗаписей();
		ЗП.Отбор.Регистратор.Установить(ВыборкаПоДокументам.Регистратор);
		
		Запись = ЗП.Добавить();
		Запись.Период 		= ВыборкаПоДокументам.Период;
		Запись.Регистратор 	= ВыборкаПоДокументам.Регистратор;
		Запись.Организация	= Организация;
		
		ЗП.Записать();
		
		Если ВосстановлениеГП Тогда //Пакетное проведение - сдвиг ГП
			Последовательности.ВзаиморасчетыПоДокументам.УстановитьГраницу(Новый МоментВремени(ВыборкаПоДокументам.Период, ВыборкаПоДокументам.Регистратор), ОтборГП);
		КонецЕсли;
		
		Сч = Сч + 1;
		Если Сч % 50 = 0 Тогда                                                                                                         
			ТекстСообщения = СтрШаблон("Обработано: %1 из %2. Обработан: %3.", Сч, ВсегоСтрок, ВыборкаПоДокументам.Регистратор);
			ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=0"), ТекстСообщения);		
		КонецЕсли;
	КонецЦикла;	            
	
	Если ВосстановлениеГП Тогда //Пакетное проведение - сдвиг ГП
		Последовательности.ВзаиморасчетыПоДокументам.УстановитьГраницу(КонецДня(Дата2), ОтборГП);		
	КонецЕсли;	
	
	Результат.ОбработаноОбъектов = Сч;
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедуры

Процедура ОбработкаПрерыванияПользователя_()
	#ЕСЛИ КЛИЕНТ ТОГДА	                    
		ОбработкаПрерыванияПользователя();
	#КОНЕЦЕСЛИ
КонецПроцедуры

#КонецОбласти

#Область ФормированиеСФ


Функция СоздатьСФнаАвансы(пОбработки, АдресВозврата = Неопределено) Экспорт       
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ   
	|	Период,	
	|
	|	Регистратор,	
	|	Регистратор.Номер 		КАК Регистратор_Номер,
	|	Регистратор.Дата		КАК Регистратор_Дата,
	|	
	|	Взаиморасчеты.Контрагент.Код 			КАК Контрагент_Код,
	|	Взаиморасчеты.Контрагент.Наименование	КАК Контрагент_Наименование,
	|
	|	ПРЕДСТАВЛЕНИЕ(Взаиморасчеты.Контрагент.СтранаРегистрации) КАК СтранаРегистрации,
	|	Взаиморасчеты.Договор.Наименование	КАК Договор_Наименование,
	|	Взаиморасчеты.Договор.Код 			КАК Договор_Код,
	|                    
	|	ДокументРасчетов,
	|	ДокументРасчетов.Организация				КАК ДокументРасчетов_Организация,	
	|	ПРЕДСТАВЛЕНИЕ(ДокументРасчетов) 			КАК ДокументРасчетов_Представление,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДокументРасчетов) 	КАК ДокументРасчетов_УИД,
	|	ДокументРасчетов.Номер						КАК ДокументРасчетов_Номер,
	|	ДокументРасчетов.Дата						КАК ДокументРасчетов_Дата,
	|
	|	СуммаВал КАК ПолученоАвансов		
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов КАК Взаиморасчеты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.СчетФактураНаАванс КАК СФ
	|ПО
	|	СФ.ДокументОснование = Взаиморасчеты.ДокументРасчетов
	|ГДЕ
	|	Период МЕЖДУ &Дата1 И &Дата2
	|	И Взаиморасчеты.Договор.УсловияОплаты 			= ЗНАЧЕНИЕ(Перечисление.УсловияОплаты.Предоплата)
	|	И Взаиморасчеты.Договор.ВидДоговора_Новый		= ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|	И Взаиморасчеты.Договор.Организация				= &Организация
	|	И Взаиморасчеты.Контрагент.СтранаРегистрации	= ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|	И Взаиморасчеты.Контрагент.Код <> ""SSP-0019"" //Частное лицо	
	|	И НЕ Взаиморасчеты.Договор.ДопСоглашение
	|	И (     
	|		ДокументРасчетов ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|		ИЛИ ДокументРасчетов ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|		ИЛИ ДокументРасчетов ССЫЛКА Документ.РекламационнаяНакладная
	|		ИЛИ ДокументРасчетов ССЫЛКА Документ.Взаимозачет
	|	)
	|	И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И СуммаВал > 0
	|	И СФ.Ссылка ЕСТЬ NULL 
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор.Номер,
	|	Регистратор.Дата
	|ИТОГИ МИНИМУМ(ПолученоАвансов) ПО
	|	ДокументРасчетов
	|";	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	
	Выборка_ДокументРасчетов	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДокументРасчетов");
	ВсегоСтрок 					= Выборка_ДокументРасчетов.Количество();
	Сч							= 0;
	ОбработаноОбъектов			= 0;
	
	ТекстСообщения = СтрШаблон("Формирование СФ на аванс. К обработке: %1 строк.", ВсегоСтрок);
	ДлительныеОперации.СообщитьПрогресс(0, ТекстСообщения);
	
	Пока Выборка_ДокументРасчетов.Следующий() Цикл
		ОбработкаПрерыванияПользователя_();
		
		ДокументРасчетов = Выборка_ДокументРасчетов.ДокументРасчетов;
		
		Выборка = Выборка_ДокументРасчетов.Выбрать();
		Если Выборка.Количество() = 1 Тогда			
			ДопРеквизиты = Новый Структура("Дата,Организация", Выборка_ДокументРасчетов.ДокументРасчетов_Дата, Выборка_ДокументРасчетов.ДокументРасчетов_Организация);
			рСоздания = СоздатьСФпоДокументуРасчетов(ДокументРасчетов, Выборка_ДокументРасчетов.ПолученоАвансов, ДопРеквизиты);			
			
			Если рСоздания.Успешно Тогда
				ОбработаноОбъектов = ОбработаноОбъектов + 1;
				Сообщить("" + ДокументРасчетов+" " + рСоздания.Данные + " " + рСоздания.Данные.СуммаДокумента);
			Иначе
				МаркировкаКС.ДобавитьОшибки(Результат, рСоздания);
			КонецЕсли;
		Иначе 
			ТекстСообщения = СтрШаблон("По основанию: %1 найдено более одной записи !", ДокументРасчетов);
			Результат.Ошибки.Добавить(ТекстСообщения);
			
			Сообщить(ТекстСообщения, СтатусСообщения.Важное);
		КонецЕсли;
		
		Сч = Сч + 1;
		Если Сч % 10 = 0 Тогда                                                                                                         
			ТекстСообщения = СтрШаблон("Обработано: %1 из %2. Обработан: %3.", Сч, ВсегоСтрок, ДокументРасчетов);
			ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=0"), ТекстСообщения);		
		КонецЕсли;
	КонецЦикла;

	Результат.ОбработаноОбъектов = Сч;
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //СоздатьСФнаАвансы(пОбработки, АдресВозврата = Неопределено) Экспорт

Функция СоздатьСФпоДокументуРасчетов(ДокументРасчетов, ПолученоАвансов, ДопРеквизиты)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	СФ_Объект = Документы.СчетФактураНаАванс.СоздатьДокумент();
	
	ЗаполнитьСФпоОснованию(СФ_Объект, ДокументРасчетов, ПолученоАвансов, ДопРеквизиты);
	
	СФ_Объект.УстановитьНовыйНомер("SSАВ-");
	
	Попытка	
		СФ_Объект.Записать(РежимЗаписиДокумента.Проведение);
		Результат.Данные = СФ_Объект.Ссылка;
	Исключение
		Результат.Ошибки.Добавить(ОписаниеОшибки());
		Результат.Успешно = Ложь;
	КонецПопытки;	
	
	Возврат Результат;	
КонецФункции //СоздатьСФпоДокументуРасчетов(ДокументРасчетов, Дата, ПолученоАвансов)

Процедура ЗаполнитьСФпоОснованию(СФ_Объект, ДокументРасчетов, ПолученоАвансов, ДопРеквизиты = Неопределено) Экспорт
	СФ_Объект.Заполнить(ДокументРасчетов);
	
	СФ_Объект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс;
	
	Если ДопРеквизиты = Неопределено Тогда                  
		СФ_Объект.Дата 				= ДокументРасчетов.Дата;	
		Сообщить(ДокументРасчетов.Дата);
	Иначе		
		СФ_Объект.Организация 		= ДопРеквизиты.Организация;	
		СФ_Объект.Дата 				= ДопРеквизиты.Дата;	
	КонецЕсли;	
	
	СФ_Объект.ДокументОснование	= ДокументРасчетов;
	СФ_Объект.СуммаДокумента 	= ПолученоАвансов;
	СФ_Объект.Сумма				= ПолученоАвансов;
	
	СФ_Объект.СтавкаНДС			= Перечисления.СтавкиНДС.НДС22;
	
	ПроцентНДС	= 100*ПроцентНДСпоСтавке(СФ_Объект.СтавкаНДС); //Вот такая волшебная функция
	СФ_Объект.СуммаНДС 	= СФ_Объект.Сумма*ПроцентНДС/(100 + ПроцентНДС);
	
	Если ТипЗнч(ДокументРасчетов) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		рШапки = ПолучитьРеквизитыШапки(ДокументРасчетов, "Контрагент,Договор,Номер,Дата");
		ЗаполнитьЗначенияСвойств(СФ_Объект, рШапки);
		
		СФ_Объект.НомерПлатежноРасчетногоДокумента = рШапки.Номер;
		СФ_Объект.ДатаПлатежноРасчетногоДокумента = рШапки.Дата;
	КонецЕсли;
	
	Авансы = СФ_Объект.Авансы;
	Авансы.Очистить();
		
	СтрокаА = Авансы.Добавить();
	
	СтрокаА.ДокументОснование   = СФ_Объект.ДокументОснование;
	СтрокаА.Контрагент 			= СФ_Объект.Контрагент;
	СтрокаА.СтавкаНДС			= СФ_Объект.СтавкаНДС;
	СтрокаА.Сумма				= СФ_Объект.Сумма;
	СтрокаА.СуммаНДС	 		= СФ_Объект.СуммаНДС;
	СтрокаА.Содержание			= "Предоплата";
	
	СтрокаА.НомерПлатежноРасчетногоДокумента	= СФ_Объект.НомерПлатежноРасчетногоДокумента;
	СтрокаА.ДатаПлатежноРасчетногоДокумента		= СФ_Объект.ДатаПлатежноРасчетногоДокумента;		
	
	ПлатежноРасчетныеДокументы = СФ_Объект.ПлатежноРасчетныеДокументы;
	ПлатежноРасчетныеДокументы.Очистить();
	
	СтрокаПРД = ПлатежноРасчетныеДокументы.Добавить();                           
	
	СтрокаПРД.НомерДокумента	= СФ_Объект.НомерПлатежноРасчетногоДокумента;
	СтрокаПРД.ДатаДокумента		= СФ_Объект.ДатаПлатежноРасчетногоДокумента;
	
	СФ_Объект.Выставлен   	= Истина;       
	СФ_Объект.ДатаВыставления = СФ_Объект.Дата;
	
	ОтветственныеЛица = ОтветственныеЛица(СФ_Объект.Организация, СФ_Объект.Дата);
	
	СФ_Объект.Руководитель		= МаркировкаКС.ПолучитьЗначениеПараметра(ОтветственныеЛица, "Руководитель");
	СФ_Объект.ГлавныйБухгалтер	= МаркировкаКС.ПолучитьЗначениеПараметра(ОтветственныеЛица, "ГлавныйБухгалтер");
КонецПроцедуры

Функция ПолучитьСуммаАвансаПоРегистратору(Регистратор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СУММА(СуммаВал) КАК Сумма	
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов	
	|ГДЕ	
	|	Регистратор = &Регистратор
	|	И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И СуммаВал > 0	
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = 0;
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
		Результат = Выборка.Сумма;	
	КонецЕсли;                     
	
	Возврат Результат;
КонецФункции //ПолучитьСуммаАвансаПоРегистратору(ПКО)

Функция ЗаписатьЗачетыАвансовВСФкРНК(пОбработки, АдресВозврата = Неопределено) Экспорт       
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Регистратор КАК Документ.РасходнаяНакладная) КАК Регистратор,
	|	ДокументРасчетов,
	|	СФнаАванс.Ссылка			КАК СФнаАванс,	
	|	СФнаРеализацию.Ссылка 		КАК СФнаРеализацию,
	|	СуммаВал
	|ПОМЕСТИТЬ ВТ_ЗачетыАвансов	
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов КАК Взаиморасчеты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.СчетФактураНаАванс	КАК СФнаАванс
	|ПО
	|	СФнаАванс.ДокументОснование = ДокументРасчетов		
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.СчетФактура.Накладные	КАК СФнаРеализацию
	|ПО
	|	СФнаРеализацию.Накладная = Взаиморасчеты.Регистратор
	|	И СФнаРеализацию.Ссылка.Проведен
	|ГДЕ
	|	Период МЕЖДУ &Дата1 И &Дата2
	|	И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Взаиморасчеты.Договор.Владелец.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|	И Взаиморасчеты.Договор.ДопСоглашение = Ложь
	|	И Взаиморасчеты.Договор.УсловияОплаты = ЗНАЧЕНИЕ(Перечисление.УсловияОплаты.Предоплата)
	|	И Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|	И Регистратор <> ДокументРасчетов
	|;
	|ВЫБРАТЬ
	|	СФнаАванс,
	|	МАКСИМУМ(НомерПлатежноРасчетногоДокумента),
	|	МАКСИМУМ(ДатаПлатежноРасчетногоДокумента)
	|ПОМЕСТИТЬ ВТ_НомераПРД	
	|ИЗ
	|	ВТ_ЗачетыАвансов
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.СчетФактураНаАванс.Авансы	КАК Авансы
	|ПО
	|	Авансы.Ссылка = СФнаАванс
	|СГРУППИРОВАТЬ ПО
	|	СФнаАванс
	|ИНДЕКСИРОВАТЬ ПО
	|	СФнаАванс
	|;		     
	|ВЫБРАТЬ
	|	ВТ_ЗачетыАвансов.*,
	|	ВТ_НомераПРД.НомерПлатежноРасчетногоДокумента, 
	|	ВТ_НомераПРД.ДатаПлатежноРасчетногоДокумента
	|ИЗ 
	|	ВТ_ЗачетыАвансов
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_НомераПРД
	|ПО
	|	ВТ_ЗачетыАвансов.СФнаАванс  = ВТ_НомераПРД.СФнаАванс		         
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор.Дата,	
	|	Регистратор.Номер
	|ИТОГИ МАКСИМУМ(СФнаРеализацию) ПО 
	|	Регистратор
	|";	
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));	
	
	Выборка_Регистратор	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Регистратор");
	ВсегоСтрок 			= Выборка_Регистратор.Количество();
	Сч					= 0;
	ОбработаноОбъектов	= 0;
	
	ТекстСообщения = СтрШаблон("Запись зачетов в СФ на реализацию. К обработке: %1 строк.", ВсегоСтрок);
	ДлительныеОперации.СообщитьПрогресс(0, ТекстСообщения);
	
	Пока Выборка_Регистратор.Следующий() Цикл
		ОбработкаПрерыванияПользователя_();
		
		Регистратор		= Выборка_Регистратор.Регистратор;
		СФнаРеализацию	= Выборка_Регистратор.СФнаРеализацию;
		
		Если ЗначениеЗаполнено(СФнаРеализацию) Тогда
			СФ_Объект = СФнаРеализацию.ПолучитьОбъект();
			Если 1=2 Тогда
				СФ_Объект = Документы.СчетФактура.СоздатьДокумент();			
			КонецЕсли;                                              
			
			ТЧ_Авансы = СФ_Объект.Авансы;
			ТЧ_Авансы.Очистить();
			Выборка = Выборка_Регистратор.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.СуммаВал > 0 Тогда
					Если ЗначениеЗаполнено(Выборка.СФнаАванс) Тогда
						СтрокаТЧ = ТЧ_Авансы.Добавить();
						
						СтрокаТЧ.ДокументОснование					= Выборка.ДокументРасчетов;
						СтрокаТЧ.СчетФактураНаАванс 				= Выборка.СФнаАванс;
						СтрокаТЧ.НомерПлатежноРасчетногоДокумента 	= Выборка.НомерПлатежноРасчетногоДокумента;
						СтрокаТЧ.ДатаПлатежноРасчетногоДокумента	= Выборка.ДатаПлатежноРасчетногоДокумента;
					Иначе
						ТекстОшибки = СтрШаблон("Не найден СФ на аванс к документу: '%1' (РНК: '%2') !", Выборка.ДокументРасчетов, Регистратор);
						Результат.Ошибки.Добавить(ТекстОшибки);
					КонецЕсли;				
				КонецЕсли;			
			КонецЦикла;
			
			Попытка
				СФ_Объект.Записать();
			Исключение           
				ТекстОшибки = СтрШаблон("Ошибка записи СФ: %1. %2.", СФ_Объект, ОписаниеОшибки());
				ЗаписатьВЛог("СфнаАвансы", ТекстОшибки, "Ошибка");
				Результат.Ошибки.Добавить(ТекстОшибки);
			КонецПопытки;
		Иначе                           
			ТекстОшибки = СтрШаблон("Не найден СФ к РНК: %1", Выборка_Регистратор.Регистратор);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;	
				
		Сч = Сч + 1;
		Если Сч % 10 = 0 Тогда                                                                                                         
			ТекстСообщения = СтрШаблон("Обработано: %1 из %2. Обработан: %3.", Сч, ВсегоСтрок, Регистратор);
			ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=0"), ТекстСообщения);		
		КонецЕсли;
	КонецЦикла;

	Результат.ОбработаноОбъектов = Сч;
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ЗаписатьЗачетыАвансовВСФкРНК(пОбработки, АдресВозврата = Неопределено) Экспорт

#КонецОбласти        

#Область РаботаНадСКД
//Удалить после обновления - процедура в общем модуле

Функция ВывестиСхемуВТЗ(СК, ИмяНастройки = Неопределено, ПараметрыДанных = Неопределено, ДопПараметры = Неопределено) Экспорт
	Отбор 			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Отбор",			Новый Структура);
	ВнешниеДанные	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВнешниеДанные", Новый Структура);	
	МВТ				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "МВТ",			Новый МенеджерВременныхТаблиц);	
	Адрес			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Адрес", 		"");
	
	КМ = Новый КомпоновщикМакетаКомпоновкиДанных;	
	КН = Новый КомпоновщикНастроекКомпоновкиДанных;
	КН.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СК));
	
	Если ИмяНастройки = Неопределено Тогда
		КН.ЗагрузитьНастройки(СК.НастройкиПоУмолчанию);
	Иначе
		КН.ЗагрузитьНастройки(СК.ВариантыНастроек[ИмяНастройки].Настройки);	
	КонецЕсли; 
	
	КН.Настройки.Отбор.Элементы.Очистить();
	
	Если ТипЗнч(ПараметрыДанных) = Тип("Структура") Тогда
		Для Каждого Элемент Из ПараметрыДанных Цикл
			Параметр=КН.Настройки.ПараметрыДанных.Элементы.Найти(Элемент.Ключ);
			Если Параметр<>Неопределено Тогда
				Параметр.Использование	=Истина;
				Параметр.Значение		=Элемент.Значение;			
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;	
	
	Если Отбор <> Неопределено Тогда
		Для Каждого Элемент_Отбора Из Отбор Цикл
			ДобавитьПолеОтбора(КН,Элемент_Отбора);		
		КонецЦикла; 
	КонецЕсли;
	
	ДР	= Неопределено;
	КМ	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МК	= КМ.Выполнить(СК,КН.Настройки, ДР,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПВ = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ПК = Новый ПроцессорКомпоновкиДанных;
	
	ПК.Инициализировать(МК, ВнешниеДанные, , Истина, , МВТ);
	
	Возврат ПВ.Вывести(ПК);	
КонецФункции //ВывестиСхемуВТЗ(СК, ИмяНастройки = Неопределено, ПараметрыДанных = Неопределено, ДопПараметры = Неопределено) Экспорт

Процедура ДобавитьПолеОтбора(КН, Элемент_Отбора)	
	Если КН.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Элемент_Отбора.Ключ))=Неопределено Тогда Возврат КонецЕсли;
	
	Элемент_Пол					= КН.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Элемент_Пол.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных(Элемент_Отбора.Ключ);
	Элемент_Пол.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВИерархии;
	Элемент_Пол.ПравоеЗначение	= Элемент_Отбора.Значение;	
КонецПроцедуры
	
#КонецОбласти

Функция ОтборГП() Экспорт
	Отбор = Неопределено;
	Если ЕстьОрганизацияВГП Тогда
		Отбор = Новый Структура("Организация", Организация);
	КонецЕсли;
	Возврат Отбор;
КонецФункции //ОтборГП()

Функция ПрописатьУИДСтрокиВыписки(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.ДвиженияДенежныхСредств
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Проведен
	|	" + ?(ЗначениеЗаполнено(ВыбДок), " И Ссылка = &ВыбДок", "") + "
	|УПОРЯДОЧИТЬ ПО
	|	Дата,Номер	
	|";                             
	
	Запрос.УстановитьПараметр("Дата1", 	НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", 	КонецДня(Дата2));
	
	Запрос.УстановитьПараметр("ВыбДок", ВыбДок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок  = Выборка.Количество();
	Сч 			= 0;
	
	ДлительныеОперации.СообщитьПрогресс(0, СтрШаблон("К обработке: %1 док-ов.", ВсегоСтрок));
	
	мСсылок = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ОбработатьДДС(Выборка.Ссылка);
		
		Сч = Сч + 1;						
		Если Сч % 10 = 0 ИЛИ Сч >= ВсегоСтрок Тогда			  
			ТекстСообщения = СтрШаблон("Обработано: %1 из %2. Обработан: %3.", Сч, ВсегоСтрок, Выборка.Ссылка);
			ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=0"), ТекстСообщения);
		КонецЕсли;	
	КонецЦикла;	
	
	Результат.ОбработаноОбъектов = Сч;
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

Функция ОбработатьДДС(ДокСсылка)
	ПустойУИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Запрос = Новый Запрос;	
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПустойУИД", ПустойУИД);
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НомерСтроки,
	|	УИД_СтрокиПлатежа
	|ИЗ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ГДЕ
	|	Платежи.Ссылка = &ДокСсылка
	|	И Платежи.УИД_СтрокиПлатежа = &ПустойУИД
	|";
	
	ПараметрыСеанса.ОтключитьКонтрольДЗР = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.НомерСтроки) Тогда
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		Если 1 = 2 Тогда
			ДокОбъект = Документы.ДвиженияДенежныхСредств.СоздатьДокумент();		
		КонецЕсли;	
		
		Для каждого СтрокаП Из ДокОбъект.Платежи Цикл
			Если СтрокаП.УИД_СтрокиПлатежа = ПустойУИД Тогда
				СтрокаП.УИД_СтрокиПлатежа = Новый УникальныйИдентификатор;			
			КонецЕсли;		
		КонецЦикла;
		
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;	
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Платежи.Ссылка,	
	|	Платежи.Контрагент,	
	|	Платежи.Договор,
	|	Приход,
	|	Расход,
	|	Затраты,	
	|	Взаиморасчеты.СуммаВал,	
	|	Взаиморасчеты.НомерСтроки 	КАК Взаиморасчеты_НомерСтроки,
	|	Платежи.УИД_СтрокиПлатежа   КАК УИД_СтрокиПлатежа
	|ИЗ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
	|ПО  
	|	Взаиморасчеты.Регистратор = Платежи.Ссылка
	|	И Взаиморасчеты.Контрагент = Платежи.Контрагент
	|	И Взаиморасчеты.СуммаВал = Платежи.Приход	
	|ГДЕ
	|	Платежи.Ссылка = &ДокСсылка	
	|	И НЕ Платежи.Затраты
	|	И Платежи.Договор.ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|	И Взаиморасчеты.УИД_СтрокиПлатежа <> Платежи.УИД_СтрокиПлатежа
	|УПОРЯДОЧИТЬ ПО
	|	Взаиморасчеты.НомерСтроки
	|";	
	
	НЗ = РегистрыНакопления.Взаиморасчеты.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокСсылка);
	
	НЗ.Прочитать();
	ИндексыСтрок = Новый Соответствие;
	Для каждого Запись Из НЗ Цикл
		ИндексыСтрок[Запись.НомерСтроки] = НЗ.Индекс(Запись);	
	КонецЦикла;
	
	Надо = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Взаиморасчеты_НомерСтроки) Тогда
			ИндексСтроки = ИндексыСтрок[Выборка.Взаиморасчеты_НомерСтроки];
			Если ИндексСтроки<>Неопределено Тогда			
				Запись = НЗ.Получить(ИндексСтроки);
				Запись.УИД_СтрокиПлатежа = Выборка.УИД_СтрокиПлатежа;
				
				Надо = Истина;
			КонецЕсли;			
		КонецЕсли;	
	КонецЦикла;
	
	Если Надо Тогда
		НЗ.Записать();	
	КонецЕсли;
	
КонецФункции // ()

Функция ЗагрузитьППВходящие(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ТипЧисло = ПолучитьОписаниеТиповЧисла(5,0);
	
	ДлительныеОперации.СообщитьПрогресс(0, "Разбор файла данных....");
	
	ТЗ = ЗначениеИзСтрокиВнутр(пОбработки.Данные);	
	
	ДлительныеОперации.СообщитьПрогресс(0, "Парсинг номеров....");
	
	ТЗ.Колонки.Добавить("РеальныйНомер", 	ПолучитьОписаниеТиповСтроки(Метаданные.Документы.ДвиженияДенежныхСредств.ДлинаНомера));
	ТЗ.Колонки.Добавить("НомерСтроки", 		ТипЧисло);
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		СтрокаТЗ.РеальныйНомер	= "SNM-" + Лев(СтрокаТЗ.Номер, 6);	
		СтрокаТЗ.НомерСтроки	= ТипЧисло.ПривестиЗначение(Прав(СтрокаТЗ.Номер, 4));
	КонецЦикла;
	//ТЗ.ВыбратьСтроку();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_НомераПП ИЗ &ТЗ КАК ТЗ
	|;
	|ВЫБРАТЬ
	|	ВТ_НомераПП.РеальныйНомер,
	|	ВТ_НомераПП.Номер,
	|	ВТ_НомераПП.Дата,
	|	ВТ_НомераПП.НомерСтроки,
	|	ВТ_НомераПП.Контрагент_Код,  
	|	ВТ_НомераПП.Договор_КодОпер,
	|	ВТ_НомераПП.Ссылка_УИД,
	|	ВТ_НомераПП.СуммаДокумента		КАК СуммаДокумента,
	|	Контрагенты.Ссылка 				КАК Контрагент2,
	|	Платежи.Ссылка,
	|	Платежи.Ссылка.Организация 		КАК Организация,
	|	Платежи.Ссылка.БанковскийСчет	КАК СчетОрганизации,
	|	Платежи.Ссылка.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,	
	|	Платежи.Контрагент				КАК Контрагент,
	|	Платежи.Договор					КАК Договор,
	|	Платежи.УИД_СтрокиПлатежа,
	|	Платежи.СтатьяДДС				КАК СтатьяДДС,
	|	Платежи.Приход,
	|	ПОДСТРОКА(Платежи.СтрокаБанкКлиент,1,500) КАК СтрокаБанкКлиент,
	|	ППВход.Ссылка 					КАК ППВход_Ссылка
	|ИЗ	
	|	ВТ_НомераПП
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ПО
	|	Платежи.Ссылка.Номер	= ВТ_НомераПП.РеальныйНомер
	|	И Платежи.Ссылка.Дата	= ВТ_НомераПП.Дата
	|	И Платежи.НомерСтроки	= ВТ_НомераПП.НомерСтроки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Контрагенты КАК Контрагенты
	|ПО
	|	Контрагенты.Код = ВТ_НомераПП.Контрагент_Код
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ППВход
	|ПО
	|	ППВход.УИД_СтрокиПлатежа = Платежи.УИД_СтрокиПлатежа
	|	ИЛИ (ППВход.Номер = ВТ_НомераПП.Номер И ППВход.Дата = ВТ_НомераПП.Дата)
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_НомераПП.Дата,
	|	ВТ_НомераПП.Номер
	|";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	ДлительныеОперации.СообщитьПрогресс(0, "Запрос по ДДС. Строк ПП: " + ТЗ.Количество());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();	
	Сч			= 0;
	
	ДлительныеОперации.СообщитьПрогресс(0, СтрШаблон("К обработке: %1 док-ов.", ВсегоСтрок));
	
	мСсылок = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ОбработкаПрерыванияПользователя_();
		
		СоздатьОбновитьПП(Выборка);
		
		Сч = Сч + 1;						
		Если Сч % 10 = 0 ИЛИ Сч >= ВсегоСтрок Тогда			  
			ТекстСообщения = СтрШаблон("Обработано: %1 из %2. Обработан: %3.", Сч, ВсегоСтрок, Выборка.Ссылка);
			ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=0"), ТекстСообщения);
		КонецЕсли;	
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Сч;
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗагрузитьППВходящие(пОбработки, АдресВозврата = Неопределено) Экспорт

Функция СверитьППВходящие(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	ТипЧисло = ПолучитьОписаниеТиповЧисла(5,0);
	
	ДлительныеОперации.СообщитьПрогресс(0, "Разбор файла данных....");
	
	ТЗ = ЗначениеИзСтрокиВнутр(пОбработки.Данные);	
	
	ДлительныеОперации.СообщитьПрогресс(0, "Парсинг номеров....");
	
	ТЗ.Колонки.Добавить("РеальныйНомер", 	ПолучитьОписаниеТиповСтроки(Метаданные.Документы.ДвиженияДенежныхСредств.ДлинаНомера));
	ТЗ.Колонки.Добавить("НомерСтроки", 		ТипЧисло);
	ТЗ.Колонки.Добавить("Ссылка", 			Новый ОписаниеТипов("ДокументСсылка.ПоступлениеНаРасчетныйСчет"));	
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		СтрокаТЗ.Номер = СокрЛП(СтрокаТЗ.Номер); 
		СтрокаТЗ.РеальныйНомер	= "SMN-" + Лев(СтрокаТЗ.Номер, 6);	
		СтрокаТЗ.НомерСтроки	= ТипЧисло.ПривестиЗначение(Прав(СтрокаТЗ.Номер, 4));
		СтрокаТЗ.Ссылка			= Документы.ПоступлениеНаРасчетныйСчет.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТЗ.Ссылка_УИД));
	КонецЦикла;
	//ТЗ.ВыбратьСтроку();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "    
	|ВЫБРАТЬ
	|	Ссылка,
	|	КонтрагентПоБанку,
	|	КонтрагентПоБанку.Код,	
	|	Приход,	
	|	СУММА(1)
	|ПОМЕСТИТЬ ВТ_Дубли	
	|ИЗ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ГДЕ
	|	Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Приход > 0
	|	И НЕ Контрагент.Код = ""SMN-2100""
	|	И НЕ Контрагент.Код = ""SMN-2988""
	|	И Ссылка.БанковскийСчет ССЫЛКА Справочник.БанковскиеСчета
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	КонтрагентПоБанку,	
	|	Приход
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|;
	|ВЫБРАТЬ
	|	ВТ_Дубли.Ссылка,
	|	ВТ_Дубли.КонтрагентПоБанку,
	|	ВТ_Дубли.Приход,
	|	Платежи.НомерСтроки			КАК НомерСтроки,
	|	Платежи.УИД_СтрокиПлатежа 	КАК УИД_СтрокиПлатежа
	|ПОМЕСТИТЬ ВТ_Дубли2
	|ИЗ
	|	ВТ_Дубли	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ПО
	|	Платежи.Ссылка = ВТ_Дубли.Ссылка	
	|	И Платежи.КонтрагентПоБанку = ВТ_Дубли.КонтрагентПоБанку
	|	И Платежи.Приход = ВТ_Дубли.Приход
	|;
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_НомераПП ИЗ &ТЗ КАК ТЗ
	|;
	|ВЫБРАТЬ     
	|	ВТ_Дубли2.НомерСтроки,
	|	ВТ_НомераПП.РеальныйНомер		КАК РеальныйНомер,
	|	ВТ_НомераПП.Номер,
	|	ВТ_НомераПП.Дата,
	|	ВТ_НомераПП.НомерСтроки,
	|	ВТ_НомераПП.Контрагент_Код			КАК КонтрБух_Код,  
	|	ВТ_НомераПП.Контрагент_Наименование	КАК КонтрБух_Наименование,  
	|	Платежи.КонтрагентПоБанку.Код	КАК КонтрПоБанку_Код,
	|	ВТ_НомераПП.Контрагент_ИНН		КАК КонтрБух_ИНН,
	|	ВТ_НомераПП.Ссылка_УИД,
	|	ВТ_НомераПП.СуммаДокумента		КАК СуммаПП,
	|	Платежи.Приход					КАК СуммаДДС,
	|	Контрагенты.Ссылка 				КАК Контрагент2,	
	|	Платежи.Ссылка					КАК ДДС_Ссылка,
	|	Платежи.КонтрагентПоБанку		КАК КонтрагентПоБанку,
	|	Платежи.КонтрагентПоБанку.ИНН	КАК КонтрагентПоБанку_ИНН,
	|	Платежи.Ссылка,
	|	Платежи.Ссылка.Организация 		КАК Организация,
	|	Платежи.Ссылка.БанковскийСчет	КАК СчетОрганизации,
	|	Платежи.Ссылка.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,		
	|	Платежи.Договор					КАК Договор,
	|	Платежи.УИД_СтрокиПлатежа		КАК ДДС_УИД_СтрокиПлатежа,
	|	Платежи.СтатьяДДС				КАК СтатьяДДС,
	|	ПОДСТРОКА(Платежи.СтрокаБанкКлиент,1,500) КАК СтрокаБанкКлиент,
	|	ППВход.Ссылка					КАК ППВход_Ссылка
	|ПОМЕСТИТЬ ВТ_КривыеПривязки
	|ИЗ	
	|	ВТ_НомераПП
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ПО
	|	Платежи.Ссылка.Номер	= ВТ_НомераПП.РеальныйНомер
	|	И Платежи.Ссылка.Дата	= ВТ_НомераПП.Дата
	|	И Платежи.НомерСтроки	= ВТ_НомераПП.НомерСтроки
	//|	И Платежи.Приход		= ВТ_НомераПП.СуммаДокумента
	//|	И Платежи.КонтрагентПоБанку.Код = ВТ_НомераПП.Контрагент_Код
	//|	И Платежи.Приход 		= ВТ_НомераПП.СуммаДокумента
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Контрагенты КАК Контрагенты
	|ПО
	|	Контрагенты.Код = ВТ_НомераПП.Контрагент_Код
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ППВход
	|ПО
	|	ППВход.УИД_СтрокиПлатежа = Платежи.УИД_СтрокиПлатежа
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_Дубли2
	|ПО
	|	ВТ_Дубли2.Ссылка = Платежи.Ссылка 
	|	И ВТ_Дубли2.НомерСтроки = Платежи.НомерСтроки
	|ГДЕ
	|	IsNULL(Платежи.Приход,0) <> ВТ_НомераПП.СуммаДокумента
	|	И Платежи.КонтрагентПоБанку.ИНН <> ""7707083893"" //СБЕРБАНК ПАО	
	//|	ИЛИ ВТ_НомераПП.Номер = ""0030850061""
	|;
	|ВЫБРАТЬ
	|	ВТ_КривыеПривязки.РеальныйНомер, 
	|	ВТ_КривыеПривязки.СуммаДДС							КАК Сумма_ДДС,
	|	ВТ_КривыеПривязки.ППВход_Ссылка.СуммаДокумента		КАК ПП_Сумма,
	|	ВТ_НомераПП.СуммаДокумента,
	|	ВТ_КривыеПривязки.КонтрагентПоБанку					КАК Контрагент_ДДС,
	|	ВТ_КривыеПривязки.КонтрагентПоБанку_ИНН				КАК Контрагент_ДДС_ИНН,
	|	ВТ_КривыеПривязки.ППВход_Ссылка.Контрагент			КАК Контрагент_ПП,
	|	ВТ_КривыеПривязки.Договор							КАК Договор_ДДС,
	|	ВТ_НомераПП.Контрагент_Наименование,
	|	ВТ_НомераПП.Ссылка									КАК ПРС_Ссылка,	
	|	ВТ_КривыеПривязки.ДДС_УИД_СтрокиПлатежа 			КАК УИД_СтрокиПлатежа_ДДС,
	|	ВТ_КривыеПривязки.ППВход_Ссылка,
	|	ВТ_КривыеПривязки.ППВход_Ссылка.УИД_СтрокиПлатежа	КАК ПП_УИД_СтрокиПлатежа	
	|ИЗ                   
	|	ВТ_КривыеПривязки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_НомераПП
	|ПО
	|   ВТ_КривыеПривязки.РеальныйНомер				= ВТ_НомераПП.РеальныйНомер		
	|   И ВТ_КривыеПривязки.КонтрагентПоБанку_ИНН 	= ВТ_НомераПП.Контрагент_ИНН
	|   И ВТ_КривыеПривязки.СуммаДДС 				= ВТ_НомераПП.СуммаДокумента
	|ГДЕ
	|	ВТ_КривыеПривязки.ППВход_Ссылка.ВерсияДанных ЕСТЬ НЕ NULL	
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_НомераПП.Дата,
	|	ВТ_НомераПП.Номер
	|";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);	
	
	рЗапроса = Запрос.Выполнить();
	
	//ТЗ = рЗапроса.Выгрузить();	
	//Сообщить(ТЗ.Количество());
	//ТЗ.ВыбратьСтроку();	
	
	Выборка 	= рЗапроса.Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;                    
	
	ДлительныеОперации.СообщитьПрогресс(0, "Запрос по ДДС. Строк ПП: " + ВсегоСтрок);
	
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.ППВход_Ссылка.ПолучитьОбъект();	
		
		ДокОбъект.Контрагент 		= Выборка.Контрагент_ДДС;
		ДокОбъект.Договор	 		= Выборка.Договор_ДДС;
		ДокОбъект.СуммаДокумента    = Выборка.Сумма_ДДС;
		ДокОбъект.УИД_СтрокиПлатежа = Выборка.УИД_СтрокиПлатежа_ДДС;		
		
		ДокОбъект.Записать();
		
		Сч = Сч + 1;						
		Если Сч % 10 = 0 ИЛИ Сч >= ВсегоСтрок Тогда			  
			ТекстСообщения = СтрШаблон("Обработано: %1 из %2. Обработан: %3.", Сч, ВсегоСтрок, Выборка.ППВход_Ссылка);
			ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=0"), ТекстСообщения);
		КонецЕсли;	
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Сч;
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //СверитьППВходящие(пОбработки, АдресВозврата = Неопределено) Экспорт

Функция СоздатьОбновитьПП(ВыборкаПП)
	Менеджер = Документы.ПоступлениеНаРасчетныйСчет;
	
	Если ЗначениеЗаполнено(ВыборкаПП.ППВход_Ссылка) Тогда
		ДокОбъект = ВыборкаПП.ППВход_Ссылка.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();			
		
		ДокОбъект.УстановитьСсылкуНового(Менеджер.ПолучитьСсылку(ВыборкаПП.Ссылка_УИД));
		ДокОбъект.УИД_СтрокиПлатежа = ВыборкаПП.УИД_СтрокиПлатежа;
	КонецЕсли;   
	
	ЗаполнитьЗначенияСвойств(ДокОбъект, ВыборкаПП);	
	ЗаполнитьЗначенияСвойств(ДокОбъект, ПолучитьНомерДатуПП(ВыборкаПП.СтрокаБанкКлиент)); //Номер и дата ПП  
	
	Если НЕ ЗначениеЗаполнено(ДокОбъект.Контрагент) Тогда
		ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду(ВыборкаПП.Контрагент_Код);					
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокОбъект.Договор) Тогда
		ДокОбъект.Договор = Справочники.Договоры.НайтиПоКоду(ВыборкаПП.Договор_КодОпер);			
	КонецЕсли;
	
	Сообщить("Док-т: " + ДокОбъект + ", контрагент " + ДокОбъект.Контрагент);
	
	ДокОбъект.Автор = ПараметрыСеанса.Пользователь;
	
	ДокОбъект.ОбменДанными.Загрузка = Истина;
	ДокОбъект.ПометкаУдаления = Ложь;
	ДокОбъект.Проведен = Истина;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);		
	Исключение                                     
		ТекстСообщения = СтрШаблон("Ошибка записи ПП вход.: %1 от %2, контрагент: %3. %4", ДокОбъект.Номер, ДокОбъект.Дата, ДокОбъект.Контрагент, ОписаниеОшибки());
		ЗаписатьВЛог("ПроведениеПоВзаиморасчетам", ТекстСообщения, "Ошибка");
		
		Сообщить(ТекстСообщения);
	КонецПопытки;	
КонецФункции //СоздатьОбновитьПП(ВыборкаПП)

Функция ПолучитьНомерДатуПП(СтрокаБанкКлиент) Экспорт
	Результат = Новый Структура("НомерВходящегоДокумента,ДатаВходящегоДокумента", "", ПустаяДата());
	
	Части = СтрРазделить(СтрокаБанкКлиент, Символы.ПС);	
	Для каждого Стр Из Части Цикл
		Поля = МаркировкаКС.СтрокуВСтруктуру(Стр, "Ключ,Значение", "=");
		Если ВРег(Поля.Ключ) = "НОМЕР" Тогда
			Результат.НомерВходящегоДокумента = СокрЛП(Поля.Значение);					
		КонецЕсли;		
		Если ВРег(Поля.Ключ) = "ДАТА" Тогда
			Результат.ДатаВходящегоДокумента = ПолучитьДатуИзСтроки(СокрЛП(Поля.Значение));
		КонецЕсли;	                                                     
		Если ЗначениеЗаполнено(Результат.ДатаВходящегоДокумента) И ЗначениеЗаполнено(Результат.НомерВходящегоДокумента) Тогда
			Прервать;		
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //ПолучитьНомерДатуПП(СтрокаБанкКлиент)

Функция ПолучитьДатуИзСтроки(СтрДаты)
	Результат = ПустаяДата();
	
	Части = СтрРазделить(СтрДаты, ".");	
	Если Части.Количество() < 0 Тогда
		Возврат Результат;
	КонецЕсли;	
	
	ТипЧисло = ПолучитьОписаниеТиповЧисла(10,0);
	
	ЧислоДаты	= Части[0];
	МесяцДаты 	= Части[1];	
	ГодДаты 	= Части[2];
	Если СтрДлина(ГодДаты) = 2 Тогда
		Если Число(ГодДаты) < 50 Тогда
			ГодДаты = "20" + ГодДаты;
		Иначе
			ГодДаты = "19" + ГодДаты ;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Результат = Дата(ТипЧисло.ПривестиЗначение(ГодДаты), ТипЧисло.ПривестиЗначение(МесяцДаты), ТипЧисло.ПривестиЗначение(ЧислоДаты));		
	Исключение		
	КонецПопытки;
	
	Возврат Результат;	
КонецФункции

Функция ПрописатьНомераВходящих(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПРС.Ссылка		КАК Ссылка,	              
	|	Платежи.Ссылка 	КАК ДДС,
	|	ПРС.ДатаВходящегоДокумента,
	|	ПРС.УИД_СтрокиПлатежа,
	|	ПОДСТРОКА(Платежи.СтрокаБанкКлиент,1,200) 	КАК СтрокаБанкКлиент,
	|	Платежи.НазначениеПлатежа					КАК НазначениеПлатежа
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПРС
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ПО
	|	Платежи.УИД_СтрокиПлатежа = ПРС.УИД_СтрокиПлатежа		
	|ГДЕ                             
	|	ПРС.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ПРС.УИД_СтрокиПлатежа <> &ПустойУИД
	|	И (ДатаВходящегоДокумента <= ДАТАВРЕМЯ(2000,1,1) ИЛИ ПОДСТРОКА(ПРС.НазначениеПлатежа,1,100) = """")
	|	И Платежи.Ссылка ЕСТЬ НЕ NULL
	|УПОРЯДОЧИТЬ ПО
	|	ПРС.Дата, ПРС.Номер
	|";                             
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	Запрос.УстановитьПараметр("ПустойУИД", ПустойУИД);
	
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи = Истина;
	ПараметрыСеанса.СверткаБазы = Истина;
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;                    
	
	ДлительныеОперации.СообщитьПрогресс(0, "Запрос по ПРС. Док-ов: " + ВсегоСтрок);	
	
	Пока Выборка.Следующий() Цикл                          
		ОбработкаПрерыванияПользователя_();
		
		Если ЗначениеЗаполнено(Выборка.СтрокаБанкКлиент) Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ЗаполнитьЗначенияСвойств(ДокОбъект, ПолучитьНомерДатуПП(Выборка.СтрокаБанкКлиент));
			
			Если НЕ ЗначениеЗаполнено(ДокОбъект.ДокОснование) Тогда
				ДокОбъект.ДокОснование = Выборка.ДДС;			
			КонецЕсли;	
			Если ПустаяСтрока(ДокОбъект.НазначениеПлатежа) Тогда
				ДокОбъект.НазначениеПлатежа = Выборка.НазначениеПлатежа;			
			КонецЕсли;
			
			ДокОбъект.Записать();		
		КонецЕсли;		
		
		Сч = Сч + 1;						
		Если Сч % 10 = 0 ИЛИ Сч >= ВсегоСтрок Тогда			  
			ТекстСообщения = СтрШаблон("Обработано: %1 из %2. Обработан: %3.", Сч, ВсегоСтрок, Выборка.Ссылка);
			ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=0"), ТекстСообщения);
		КонецЕсли;	
	КонецЦикла;
	
	ПараметрыСеанса.СверткаБазы = Ложь;
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи = Ложь;
	
	Результат.ОбработаноОбъектов = Сч;
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПерепровестиДокументыПоРазвернутымСальдо(пОбработки, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, пОбработки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Договор,
	|	ДокументРасчетов,
	|	
	|	ВЫБОР КОГДА СуммаВалКонечныйОстаток > 0 ТОГДА СуммаВалКонечныйОстаток ИНАЧЕ 0 КОНЕЦ КАК СуммаВалКонРазвДт,
	|	ВЫБОР КОГДА СуммаВалКонечныйОстаток < 0 ТОГДА -СуммаВалКонечныйОстаток ИНАЧЕ 0 КОНЕЦ КАК СуммаВалКонРазвКт	
	|ПОМЕСТИТЬ ВТ_Врем 	
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов.ОстаткиИОбороты(&Дата1,&Дата2)
	|;		
	|ВЫБРАТЬ 
	|	Договор.Владелец КАК Контрагент,
	|	Договор.Владелец.Код,
	|	Договор,
	|	Договор.Код,
	|	СУММА(СуммаВалКонРазвДт) КАК СуммаВалКонРазвДт,
	|	СУММА(СуммаВалКонРазвКт) КАК СуммаВалКонРазвКт		
	|ИЗ
	|	ВТ_Врем	                                            	
	|СГРУППИРОВАТЬ ПО
	|	Договор	
	|ИМЕЮЩИЕ                                                 
	|	СУММА(СуммаВалКонРазвДт) > 0
	|	И СУММА(СуммаВалКонРазвКт) > 0
	|УПОРЯДОЧИТЬ ПО
	|	Договор.Владелец.Наименование		
	|";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
			
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;                    
	
	ДлительныеОперации.СообщитьПрогресс(0, "Найдено договоров с развернутым сальдо: " + ВсегоСтрок);	
	
	мДата1 = Дата1;
	
	Пока Выборка.Следующий() Цикл                          
		ОбработкаПрерыванияПользователя_();
		
		ДатаНачала = ПолучитьДатуНезакрытогоДокумента(Выборка.Договор);
		
		ТекстСообщения = СтрШаблон("Обрабатывается: %1 из %2. Контрагент: %3 (%4), проведение с %5.", 
			Сч, ВсегоСтрок, Выборка.Контрагент, Выборка.Контрагент.Код, Формат(ДатаНачала, "ДФ=dd.MM.yyyy"));
		ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=0"), ТекстСообщения);		
		
		пПроведения = Новый Структура("Дата1,Дата2,ВыбКонтрагент", ДатаНачала, Дата2, Выборка.Контрагент);		
		ПровестиПоВзаиморасчетам(пПроведения);
	КонецЦикла;    
	
	Дата1 = мДата1;
	
	Результат.ОбработаноОбъектов = Сч;
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);	
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции // ()

Функция ПолучитьДатуНезакрытогоДокумента(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Договор,        
	|	ДокументРасчетов,
	|	ДокументРасчетов.Дата КАК Дата,
	|	СуммаВалНачальныйОстаток,
	|	СуммаВалПриход,
	|	СуммаВалРасход,
	|	СуммаВалКонечныйОстаток	
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов.ОстаткиИОбороты(&Дата1, &Дата2 , , , Договор = &Договор) КАК ВзаиморасчетыПоДокументамРасчетовОстаткиИОбороты
	|ГДЕ
	|	СуммаВалКонечныйОстаток <> 0	
	|	И ДокументРасчетов.Дата ЕСТЬ НЕ NULL
	|УПОРЯДОЧИТЬ ПО
	|	ДокументРасчетов.Дата	
	|";
	
	Запрос.УстановитьПараметр("Дата1", 	'20240101');
	Запрос.УстановитьПараметр("Дата2", 	'20261231');
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Результат = '20240101';
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Дата) И Выборка.Дата > Результат Тогда
		Результат = Выборка.Дата;	
	КонецЕсли;                  
	
	Возврат Результат;
КонецФункции //ПолучитьДатуНезакрытогоДокумента(Договор)

мВалютаУпр			= Константы.ВалютаУпрУчета.Получить();
ПустойУИД			= Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
ЕстьОрганизацияВГП	= (Метаданные.Последовательности.ВзаиморасчетыПоДокументам.Измерения.Найти("Организация") <> Неопределено);
